'''

model.summary()
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_5 (InputLayer)             (None, 224, 224, 3)   0                                            
____________________________________________________________________________________________________
conv1 (Conv2D)                   (None, 112, 112, 64)  9472        input_5[0][0]                    
____________________________________________________________________________________________________
bn_conv1 (BatchNormalization)    (None, 112, 112, 64)  256         conv1[0][0]                      
____________________________________________________________________________________________________
activation_148 (Activation)      (None, 112, 112, 64)  0           bn_conv1[0][0]                   
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, 55, 55, 64)    0           activation_148[0][0]             
____________________________________________________________________________________________________
res2a_branch2a (Conv2D)          (None, 55, 55, 64)    4160        max_pooling2d_4[0][0]            
____________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizatio (None, 55, 55, 64)    256         res2a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_149 (Activation)      (None, 55, 55, 64)    0           bn2a_branch2a[0][0]              
____________________________________________________________________________________________________
res2a_branch2b (Conv2D)          (None, 55, 55, 64)    36928       activation_149[0][0]             
____________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizatio (None, 55, 55, 64)    256         res2a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_150 (Activation)      (None, 55, 55, 64)    0           bn2a_branch2b[0][0]              
____________________________________________________________________________________________________
res2a_branch2c (Conv2D)          (None, 55, 55, 256)   16640       activation_150[0][0]             
____________________________________________________________________________________________________
res2a_branch1 (Conv2D)           (None, 55, 55, 256)   16640       max_pooling2d_4[0][0]            
____________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizatio (None, 55, 55, 256)   1024        res2a_branch2c[0][0]             
____________________________________________________________________________________________________
bn2a_branch1 (BatchNormalization (None, 55, 55, 256)   1024        res2a_branch1[0][0]              
____________________________________________________________________________________________________
add_49 (Add)                     (None, 55, 55, 256)   0           bn2a_branch2c[0][0]              
                                                                   bn2a_branch1[0][0]               
____________________________________________________________________________________________________
activation_151 (Activation)      (None, 55, 55, 256)   0           add_49[0][0]                     
____________________________________________________________________________________________________
res2b_branch2a (Conv2D)          (None, 55, 55, 64)    16448       activation_151[0][0]             
____________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizatio (None, 55, 55, 64)    256         res2b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_152 (Activation)      (None, 55, 55, 64)    0           bn2b_branch2a[0][0]              
____________________________________________________________________________________________________
res2b_branch2b (Conv2D)          (None, 55, 55, 64)    36928       activation_152[0][0]             
____________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizatio (None, 55, 55, 64)    256         res2b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_153 (Activation)      (None, 55, 55, 64)    0           bn2b_branch2b[0][0]              
____________________________________________________________________________________________________
res2b_branch2c (Conv2D)          (None, 55, 55, 256)   16640       activation_153[0][0]             
____________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizatio (None, 55, 55, 256)   1024        res2b_branch2c[0][0]             
____________________________________________________________________________________________________
add_50 (Add)                     (None, 55, 55, 256)   0           bn2b_branch2c[0][0]              
                                                                   activation_151[0][0]             
____________________________________________________________________________________________________
activation_154 (Activation)      (None, 55, 55, 256)   0           add_50[0][0]                     
____________________________________________________________________________________________________
res2c_branch2a (Conv2D)          (None, 55, 55, 64)    16448       activation_154[0][0]             
____________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizatio (None, 55, 55, 64)    256         res2c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_155 (Activation)      (None, 55, 55, 64)    0           bn2c_branch2a[0][0]              
____________________________________________________________________________________________________
res2c_branch2b (Conv2D)          (None, 55, 55, 64)    36928       activation_155[0][0]             
____________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizatio (None, 55, 55, 64)    256         res2c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_156 (Activation)      (None, 55, 55, 64)    0           bn2c_branch2b[0][0]              
____________________________________________________________________________________________________
res2c_branch2c (Conv2D)          (None, 55, 55, 256)   16640       activation_156[0][0]             
____________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizatio (None, 55, 55, 256)   1024        res2c_branch2c[0][0]             
____________________________________________________________________________________________________
add_51 (Add)                     (None, 55, 55, 256)   0           bn2c_branch2c[0][0]              
                                                                   activation_154[0][0]             
____________________________________________________________________________________________________
activation_157 (Activation)      (None, 55, 55, 256)   0           add_51[0][0]                     
____________________________________________________________________________________________________
res3a_branch2a (Conv2D)          (None, 28, 28, 128)   32896       activation_157[0][0]             
____________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizatio (None, 28, 28, 128)   512         res3a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_158 (Activation)      (None, 28, 28, 128)   0           bn3a_branch2a[0][0]              
____________________________________________________________________________________________________
res3a_branch2b (Conv2D)          (None, 28, 28, 128)   147584      activation_158[0][0]             
____________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizatio (None, 28, 28, 128)   512         res3a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_159 (Activation)      (None, 28, 28, 128)   0           bn3a_branch2b[0][0]              
____________________________________________________________________________________________________
res3a_branch2c (Conv2D)          (None, 28, 28, 512)   66048       activation_159[0][0]             
____________________________________________________________________________________________________
res3a_branch1 (Conv2D)           (None, 28, 28, 512)   131584      activation_157[0][0]             
____________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048        res3a_branch2c[0][0]             
____________________________________________________________________________________________________
bn3a_branch1 (BatchNormalization (None, 28, 28, 512)   2048        res3a_branch1[0][0]              
____________________________________________________________________________________________________
add_52 (Add)                     (None, 28, 28, 512)   0           bn3a_branch2c[0][0]              
                                                                   bn3a_branch1[0][0]               
____________________________________________________________________________________________________
activation_160 (Activation)      (None, 28, 28, 512)   0           add_52[0][0]                     
____________________________________________________________________________________________________
res3b_branch2a (Conv2D)          (None, 28, 28, 128)   65664       activation_160[0][0]             
____________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizatio (None, 28, 28, 128)   512         res3b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_161 (Activation)      (None, 28, 28, 128)   0           bn3b_branch2a[0][0]              
____________________________________________________________________________________________________
res3b_branch2b (Conv2D)          (None, 28, 28, 128)   147584      activation_161[0][0]             
____________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizatio (None, 28, 28, 128)   512         res3b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_162 (Activation)      (None, 28, 28, 128)   0           bn3b_branch2b[0][0]              
____________________________________________________________________________________________________
res3b_branch2c (Conv2D)          (None, 28, 28, 512)   66048       activation_162[0][0]             
____________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048        res3b_branch2c[0][0]             
____________________________________________________________________________________________________
add_53 (Add)                     (None, 28, 28, 512)   0           bn3b_branch2c[0][0]              
                                                                   activation_160[0][0]             
____________________________________________________________________________________________________
activation_163 (Activation)      (None, 28, 28, 512)   0           add_53[0][0]                     
____________________________________________________________________________________________________
res3c_branch2a (Conv2D)          (None, 28, 28, 128)   65664       activation_163[0][0]             
____________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizatio (None, 28, 28, 128)   512         res3c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_164 (Activation)      (None, 28, 28, 128)   0           bn3c_branch2a[0][0]              
____________________________________________________________________________________________________
res3c_branch2b (Conv2D)          (None, 28, 28, 128)   147584      activation_164[0][0]             
____________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizatio (None, 28, 28, 128)   512         res3c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_165 (Activation)      (None, 28, 28, 128)   0           bn3c_branch2b[0][0]              
____________________________________________________________________________________________________
res3c_branch2c (Conv2D)          (None, 28, 28, 512)   66048       activation_165[0][0]             
____________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048        res3c_branch2c[0][0]             
____________________________________________________________________________________________________
add_54 (Add)                     (None, 28, 28, 512)   0           bn3c_branch2c[0][0]              
                                                                   activation_163[0][0]             
____________________________________________________________________________________________________
activation_166 (Activation)      (None, 28, 28, 512)   0           add_54[0][0]                     
____________________________________________________________________________________________________
res3d_branch2a (Conv2D)          (None, 28, 28, 128)   65664       activation_166[0][0]             
____________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizatio (None, 28, 28, 128)   512         res3d_branch2a[0][0]             
____________________________________________________________________________________________________
activation_167 (Activation)      (None, 28, 28, 128)   0           bn3d_branch2a[0][0]              
____________________________________________________________________________________________________
res3d_branch2b (Conv2D)          (None, 28, 28, 128)   147584      activation_167[0][0]             
____________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizatio (None, 28, 28, 128)   512         res3d_branch2b[0][0]             
____________________________________________________________________________________________________
activation_168 (Activation)      (None, 28, 28, 128)   0           bn3d_branch2b[0][0]              
____________________________________________________________________________________________________
res3d_branch2c (Conv2D)          (None, 28, 28, 512)   66048       activation_168[0][0]             
____________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048        res3d_branch2c[0][0]             
____________________________________________________________________________________________________
add_55 (Add)                     (None, 28, 28, 512)   0           bn3d_branch2c[0][0]              
                                                                   activation_166[0][0]             
____________________________________________________________________________________________________
activation_169 (Activation)      (None, 28, 28, 512)   0           add_55[0][0]                     
____________________________________________________________________________________________________
res4a_branch2a (Conv2D)          (None, 14, 14, 256)   131328      activation_169[0][0]             
____________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024        res4a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_170 (Activation)      (None, 14, 14, 256)   0           bn4a_branch2a[0][0]              
____________________________________________________________________________________________________
res4a_branch2b (Conv2D)          (None, 14, 14, 256)   590080      activation_170[0][0]             
____________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024        res4a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_171 (Activation)      (None, 14, 14, 256)   0           bn4a_branch2b[0][0]              
____________________________________________________________________________________________________
res4a_branch2c (Conv2D)          (None, 14, 14, 1024)  263168      activation_171[0][0]             
____________________________________________________________________________________________________
res4a_branch1 (Conv2D)           (None, 14, 14, 1024)  525312      activation_169[0][0]             
____________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096        res4a_branch2c[0][0]             
____________________________________________________________________________________________________
bn4a_branch1 (BatchNormalization (None, 14, 14, 1024)  4096        res4a_branch1[0][0]              
____________________________________________________________________________________________________
add_56 (Add)                     (None, 14, 14, 1024)  0           bn4a_branch2c[0][0]              
                                                                   bn4a_branch1[0][0]               
____________________________________________________________________________________________________
activation_172 (Activation)      (None, 14, 14, 1024)  0           add_56[0][0]                     
____________________________________________________________________________________________________
res4b_branch2a (Conv2D)          (None, 14, 14, 256)   262400      activation_172[0][0]             
____________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024        res4b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_173 (Activation)      (None, 14, 14, 256)   0           bn4b_branch2a[0][0]              
____________________________________________________________________________________________________
res4b_branch2b (Conv2D)          (None, 14, 14, 256)   590080      activation_173[0][0]             
____________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024        res4b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_174 (Activation)      (None, 14, 14, 256)   0           bn4b_branch2b[0][0]              
____________________________________________________________________________________________________
res4b_branch2c (Conv2D)          (None, 14, 14, 1024)  263168      activation_174[0][0]             
____________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096        res4b_branch2c[0][0]             
____________________________________________________________________________________________________
add_57 (Add)                     (None, 14, 14, 1024)  0           bn4b_branch2c[0][0]              
                                                                   activation_172[0][0]             
____________________________________________________________________________________________________
activation_175 (Activation)      (None, 14, 14, 1024)  0           add_57[0][0]                     
____________________________________________________________________________________________________
res4c_branch2a (Conv2D)          (None, 14, 14, 256)   262400      activation_175[0][0]             
____________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024        res4c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_176 (Activation)      (None, 14, 14, 256)   0           bn4c_branch2a[0][0]              
____________________________________________________________________________________________________
res4c_branch2b (Conv2D)          (None, 14, 14, 256)   590080      activation_176[0][0]             
____________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024        res4c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_177 (Activation)      (None, 14, 14, 256)   0           bn4c_branch2b[0][0]              
____________________________________________________________________________________________________
res4c_branch2c (Conv2D)          (None, 14, 14, 1024)  263168      activation_177[0][0]             
____________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096        res4c_branch2c[0][0]             
____________________________________________________________________________________________________
add_58 (Add)                     (None, 14, 14, 1024)  0           bn4c_branch2c[0][0]              
                                                                   activation_175[0][0]             
____________________________________________________________________________________________________
activation_178 (Activation)      (None, 14, 14, 1024)  0           add_58[0][0]                     
____________________________________________________________________________________________________
res4d_branch2a (Conv2D)          (None, 14, 14, 256)   262400      activation_178[0][0]             
____________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024        res4d_branch2a[0][0]             
____________________________________________________________________________________________________
activation_179 (Activation)      (None, 14, 14, 256)   0           bn4d_branch2a[0][0]              
____________________________________________________________________________________________________
res4d_branch2b (Conv2D)          (None, 14, 14, 256)   590080      activation_179[0][0]             
____________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024        res4d_branch2b[0][0]             
____________________________________________________________________________________________________
activation_180 (Activation)      (None, 14, 14, 256)   0           bn4d_branch2b[0][0]              
____________________________________________________________________________________________________
res4d_branch2c (Conv2D)          (None, 14, 14, 1024)  263168      activation_180[0][0]             
____________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096        res4d_branch2c[0][0]             
____________________________________________________________________________________________________
add_59 (Add)                     (None, 14, 14, 1024)  0           bn4d_branch2c[0][0]              
                                                                   activation_178[0][0]             
____________________________________________________________________________________________________
activation_181 (Activation)      (None, 14, 14, 1024)  0           add_59[0][0]                     
____________________________________________________________________________________________________
res4e_branch2a (Conv2D)          (None, 14, 14, 256)   262400      activation_181[0][0]             
____________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024        res4e_branch2a[0][0]             
____________________________________________________________________________________________________
activation_182 (Activation)      (None, 14, 14, 256)   0           bn4e_branch2a[0][0]              
____________________________________________________________________________________________________
res4e_branch2b (Conv2D)          (None, 14, 14, 256)   590080      activation_182[0][0]             
____________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024        res4e_branch2b[0][0]             
____________________________________________________________________________________________________
activation_183 (Activation)      (None, 14, 14, 256)   0           bn4e_branch2b[0][0]              
____________________________________________________________________________________________________
res4e_branch2c (Conv2D)          (None, 14, 14, 1024)  263168      activation_183[0][0]             
____________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096        res4e_branch2c[0][0]             
____________________________________________________________________________________________________
add_60 (Add)                     (None, 14, 14, 1024)  0           bn4e_branch2c[0][0]              
                                                                   activation_181[0][0]             
____________________________________________________________________________________________________
activation_184 (Activation)      (None, 14, 14, 1024)  0           add_60[0][0]                     
____________________________________________________________________________________________________
res4f_branch2a (Conv2D)          (None, 14, 14, 256)   262400      activation_184[0][0]             
____________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024        res4f_branch2a[0][0]             
____________________________________________________________________________________________________
activation_185 (Activation)      (None, 14, 14, 256)   0           bn4f_branch2a[0][0]              
____________________________________________________________________________________________________
res4f_branch2b (Conv2D)          (None, 14, 14, 256)   590080      activation_185[0][0]             
____________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024        res4f_branch2b[0][0]             
____________________________________________________________________________________________________
activation_186 (Activation)      (None, 14, 14, 256)   0           bn4f_branch2b[0][0]              
____________________________________________________________________________________________________
res4f_branch2c (Conv2D)          (None, 14, 14, 1024)  263168      activation_186[0][0]             
____________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096        res4f_branch2c[0][0]             
____________________________________________________________________________________________________
add_61 (Add)                     (None, 14, 14, 1024)  0           bn4f_branch2c[0][0]              
                                                                   activation_184[0][0]             
____________________________________________________________________________________________________
activation_187 (Activation)      (None, 14, 14, 1024)  0           add_61[0][0]                     
____________________________________________________________________________________________________
res5a_branch2a (Conv2D)          (None, 7, 7, 512)     524800      activation_187[0][0]             
____________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizatio (None, 7, 7, 512)     2048        res5a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_188 (Activation)      (None, 7, 7, 512)     0           bn5a_branch2a[0][0]              
____________________________________________________________________________________________________
res5a_branch2b (Conv2D)          (None, 7, 7, 512)     2359808     activation_188[0][0]             
____________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizatio (None, 7, 7, 512)     2048        res5a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_189 (Activation)      (None, 7, 7, 512)     0           bn5a_branch2b[0][0]              
____________________________________________________________________________________________________
res5a_branch2c (Conv2D)          (None, 7, 7, 2048)    1050624     activation_189[0][0]             
____________________________________________________________________________________________________
res5a_branch1 (Conv2D)           (None, 7, 7, 2048)    2099200     activation_187[0][0]             
____________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizatio (None, 7, 7, 2048)    8192        res5a_branch2c[0][0]             
____________________________________________________________________________________________________
bn5a_branch1 (BatchNormalization (None, 7, 7, 2048)    8192        res5a_branch1[0][0]              
____________________________________________________________________________________________________
add_62 (Add)                     (None, 7, 7, 2048)    0           bn5a_branch2c[0][0]              
                                                                   bn5a_branch1[0][0]               
____________________________________________________________________________________________________
activation_190 (Activation)      (None, 7, 7, 2048)    0           add_62[0][0]                     
____________________________________________________________________________________________________
res5b_branch2a (Conv2D)          (None, 7, 7, 512)     1049088     activation_190[0][0]             
____________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizatio (None, 7, 7, 512)     2048        res5b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_191 (Activation)      (None, 7, 7, 512)     0           bn5b_branch2a[0][0]              
____________________________________________________________________________________________________
res5b_branch2b (Conv2D)          (None, 7, 7, 512)     2359808     activation_191[0][0]             
____________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizatio (None, 7, 7, 512)     2048        res5b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_192 (Activation)      (None, 7, 7, 512)     0           bn5b_branch2b[0][0]              
____________________________________________________________________________________________________
res5b_branch2c (Conv2D)          (None, 7, 7, 2048)    1050624     activation_192[0][0]             
____________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizatio (None, 7, 7, 2048)    8192        res5b_branch2c[0][0]             
____________________________________________________________________________________________________
add_63 (Add)                     (None, 7, 7, 2048)    0           bn5b_branch2c[0][0]              
                                                                   activation_190[0][0]             
____________________________________________________________________________________________________
activation_193 (Activation)      (None, 7, 7, 2048)    0           add_63[0][0]                     
____________________________________________________________________________________________________
res5c_branch2a (Conv2D)          (None, 7, 7, 512)     1049088     activation_193[0][0]             
____________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizatio (None, 7, 7, 512)     2048        res5c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_194 (Activation)      (None, 7, 7, 512)     0           bn5c_branch2a[0][0]              
____________________________________________________________________________________________________
res5c_branch2b (Conv2D)          (None, 7, 7, 512)     2359808     activation_194[0][0]             
____________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizatio (None, 7, 7, 512)     2048        res5c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_195 (Activation)      (None, 7, 7, 512)     0           bn5c_branch2b[0][0]              
____________________________________________________________________________________________________
res5c_branch2c (Conv2D)          (None, 7, 7, 2048)    1050624     activation_195[0][0]             
____________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizatio (None, 7, 7, 2048)    8192        res5c_branch2c[0][0]             
____________________________________________________________________________________________________
add_64 (Add)                     (None, 7, 7, 2048)    0           bn5c_branch2c[0][0]              
                                                                   activation_193[0][0]             
____________________________________________________________________________________________________
activation_196 (Activation)      (None, 7, 7, 2048)    0           add_64[0][0]                     
____________________________________________________________________________________________________
avg_pool (AveragePooling2D)      (None, 1, 1, 2048)    0           activation_196[0][0]             
____________________________________________________________________________________________________
flatten_4 (Flatten)              (None, 2048)          0           avg_pool[0][0]                   
____________________________________________________________________________________________________
fc1000 (Dense)                   (None, 1000)          2049000     flatten_4[0][0]                  
====================================================================================================
Total params: 25,636,712
Trainable params: 25,583,592
Non-trainable params: 53,120
____________________________________________________________________________________________________

'''
